nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxe247/demo_apps/mc_pmsm/pmsm_snsless/pin_mux.c
    /* PORTB17 (pin 93) is configured as FTM0_CH5 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_BB_CH5_PORT, BOARD_INITFTM_PWM_BB_CH5_PIN, kPORT_MuxAlt2);

    /* PORTD15 (pin 29) is configured as FTM0_CH0 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_AT_CH0_PORT, BOARD_INITFTM_PWM_AT_CH0_PIN, kPORT_MuxAlt2);

    /* PORTD16 (pin 28) is configured as FTM0_CH1 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_AB_CH1_PORT, BOARD_INITFTM_PWM_AB_CH1_PIN, kPORT_MuxAlt2);

    /* PORTE7 (pin 87) is configured as FTM0_CH7 */
    PORT_SetPinMux(BOARD_INITFTM_PWM_CB_CH7_PORT, BOARD_INITFTM_PWM_CB_CH7_PIN, kPORT_MuxAlt2);
    /* CMP0 Output is selected as FTM0 device trigger input 1 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Ftm0, kTRGMUX_TriggerInput1, kTRGMUX_SourceCmp0Output);
    /* FTM0 init trigger is selected as PDB0 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Pdb0, kTRGMUX_TriggerInput0, kTRGMUX_SourceFtm0InitTrg);
    /* FTM0 init trigger is selected as PDB1 device trigger input 0 */
    TRGMUX_SetTriggerSource(TRGMUX, kTRGMUX_Pdb1, kTRGMUX_TriggerInput0, kTRGMUX_SourceFtm0InitTrg);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitADC:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '120', peripheral: ADC1, signal: 'SE, 12', pin_signal: PTA15/FTM1_CH2/LPSPI0_PCS3/LPSPI2_PCS3/FTM7_FLT0/ADC1_SE12}
  - {pin_num: '85', peripheral: ADC0, signal: 'SE, 2', pin_signal: PTA6/FTM0_FLT1/LPSPI1_PCS1/FTM5_CH5/LPUART1_CTS/ADC0_SE2}
  - {pin_num: '100', peripheral: ADC1, signal: 'SE, 6', pin_signal: PTD4/ADC1_SE6}
  - {pin_num: '115', peripheral: ADC0, signal: 'SE, 0', pin_signal: PTA0/FTM2_CH1/LPI2C0_SCLS/FXIO_D2/FTM2_QD_PHA/LPUART0_CTS/TRGMUX_OUT3/ADC0_SE0/CMP0_IN0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitADC
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitADC(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortD);

    /* PORTA0 (pin 115) is configured as ADC0_SE0 */
    PORT_SetPinMux(BOARD_INITADC_VOLT_DCB_PORT, BOARD_INITADC_VOLT_DCB_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA15 (pin 120) is configured as ADC1_SE12 */
    PORT_SetPinMux(BOARD_INITADC_CUR_A_PORT, BOARD_INITADC_CUR_A_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTA6 (pin 85) is configured as ADC0_SE2 */
    PORT_SetPinMux(BOARD_INITADC_CUR_B_PORT, BOARD_INITADC_CUR_B_PIN, kPORT_PinDisabledOrAnalog);

    /* PORTD4 (pin 100) is configured as ADC1_SE6 */
    PORT_SetPinMux(BOARD_INITADC_CUR_C_PORT, BOARD_INITADC_CUR_C_PIN, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitCMP:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '113', peripheral: CMP0, signal: 'IN, 1', pin_signal: PTA1/FTM1_CH1/LPI2C0_SDAS/FXIO_D3/FTM1_QD_PHA/LPUART0_RTS/TRGMUX_OUT0/ADC0_SE1/CMP0_IN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCMP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitCMP(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);

    /* PORTA1 (pin 113) is configured as CMP0_IN1 */
    PORT_SetPinMux(PORTA, 1U, kPORT_PinDisabledOrAnalog);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitTP:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '127', peripheral: GPIOA, signal: 'GPIO, 14', pin_signal: PTA14/FTM0_FLT0/FTM3_FLT1/EWM_IN/FTM1_FLT0/SAI0_D3, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitTP
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitTP(void)
{
    /* Clock Gate Control: Clock enabled. The current clock selection and divider options are locked and cannot be modified. */
    CLOCK_EnableClock(kCLOCK_PortA);

    gpio_pin_config_t TP_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA14 (pin 127)  */
    GPIO_PinInit(BOARD_INITTP_TP_GPIO, BOARD_INITTP_TP_PIN, &TP_config);

    /* PORTA14 (pin 127) is configured as PTA14 */
    PORT_SetPinMux(BOARD_INITTP_TP_PORT, BOARD_INITTP_TP_PIN, kPORT_MuxAsGpio);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
